#+OPTIONS: num:nil

TOC: [[#motivation][Motivation]] | [[#demos][*Demos*]] | [[#install][*Install*]] | [[#try-it-out][Try it out]] | [[#develop][Develop]]

Promnesia is a browser extension ([[https://chrome.google.com/webstore/detail/promnesia/kdmegllpofldcpaclldkopnnjjljoiio][Chrome]]/[[https://addons.mozilla.org/en-US/firefox/addon/promnesia][Firefox]]/Firefox mobile) which serves as a web surfing copilot, enhancing your browsing history and web exploration experience.

*TLDR*: it lets you explore your browsing history *in context*: where you encountered it, in chat, on Twitter, on Reddit, or just in one of the text files on your computer.
This is unlike most modern browsers, where you can only see when you visited the link.

It allows you to answer different questions about the current web page:

- have I been here before? When? [[https://raw.githubusercontent.com/karlicoss/promnesia-demos/master/child-visits.webm][demo (30 s)]] [[https://raw.githubusercontent.com/karlicoss/promnesia-demos/master/child-visits-2.webm][demo (40s)]]
- how did I get on it? Which page has led to it? [[https://raw.githubusercontent.com/karlicoss/promnesia-demos/master/how_did_i_get_here.webm][demo (40s)]]
- why have I bookmarked it? who sent me this link? Can I just jump to the message? [[https://raw.githubusercontent.com/karlicoss/promnesia-demos/master/watch_later.webm][demo (30s)]]
- which links on this page have I already explored? [[https://raw.githubusercontent.com/karlicoss/promnesia-demos/master/mark-visited.webm][demo (30s)]],
- which posts from this blog page have I already read? [[https://raw.githubusercontent.com/karlicoss/promnesia-demos/master/mark-visited-2.webm][demo (20s)]]
- have I annotated it? [[https://raw.githubusercontent.com/karlicoss/promnesia-demos/master/highlights.webm][demo (1m)]]

You can jump straight to the [[#demos][Demos]] and [[#install][Install]] sections if you're already overexcited.

* WIP on automatic sources summary :noexport:
#+begin_src python :python "with_my python3" :dir src :results output
import pkgutil
import importlib
import inspect


from promnesia.common import Extraction
from typing import Iterable
IndexerType = Iterable[Extraction] # TODO move to promnesia? also careful with List etc...

import promnesia.sources as pkg
for importer, name, ispkg in pkgutil.walk_packages(
        path=pkg.__path__,
        prefix=pkg.__name__+'.'
):
    # TODO remove
    if name != 'promnesia.sources.vcs':
        continue
    # TODO get by output type??
    m = importlib.import_module(name)
    public = [(k, v) for k, v in inspect.getmembers(m) if not k.startswith('_')]
    indexers = [v for k, v in public if getattr(v, '__annotations__', {}).get('return') == IndexerType]
    print(indexers)
#+end_src

#+RESULTS:
: [<function index at 0x7f4856498598>]
